Revit 2026 API

# SlabShapeCrease Properties

---

The SlabShapeCrease type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreaseType | The type of the crease. |
|  | Curve | The geometry of the crease. |
|  | EndPoints | The vertices of the crease. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

SlabShapeCrease Class

Autodesk.Revit.DB Namespace